fio-test/results/crazn_seq_write/64k-psync-1.out
job1: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=24251: Tue Sep  3 17:49:55 2024
  write: IOPS=27.0k, BW=1686MiB/s (1768MB/s)(673GiB/408871msec); 0 zone resets
    clat (usec): min=69, max=3387, avg=278.80, stdev=82.21
     lat (usec): min=70, max=3393, avg=282.59, stdev=82.94
    clat percentiles (usec):
     |  1.00th=[  159],  5.00th=[  184], 10.00th=[  194], 20.00th=[  206],
     | 30.00th=[  221], 40.00th=[  249], 50.00th=[  285], 60.00th=[  297],
     | 70.00th=[  306], 80.00th=[  326], 90.00th=[  371], 95.00th=[  408],
     | 99.00th=[  627], 99.50th=[  668], 99.90th=[  742], 99.95th=[  766],
     | 99.99th=[ 1057]
   bw (  MiB/s): min= 1216, max= 2857, per=100.00%, avg=1757.38, stdev=37.22, samples=6272
   iops        : min=19456, max=45722, avg=28117.85, stdev=595.49, samples=6272
  lat (usec)   : 100=0.03%, 250=40.49%, 500=57.88%, 750=1.53%, 1000=0.06%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=3.07%, sys=5.88%, ctx=11028575, majf=1, minf=158
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,11028480,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1686MiB/s (1768MB/s), 1686MiB/s-1686MiB/s (1768MB/s-1768MB/s), io=673GiB (723GB), run=408871-408871msec

Disk stats (read/write):
    dm-0: ios=48/11028461, merge=0/0, ticks=0/2865716, in_queue=2865716, util=100.00%, aggrios=11/2205696, aggrmerge=0/0, aggrticks=0/97629, aggrin_queue=97630, aggrutil=100.00%
  nvme0n1: ios=0/1654272, merge=0/0, ticks=0/79160, in_queue=79160, util=99.39%
  nvme3n1: ios=0/1654272, merge=0/0, ticks=0/77684, in_queue=77684, util=99.36%
  nvme1n2: ios=26/2757120, merge=0/0, ticks=2/119224, in_queue=119226, util=100.00%
  nvme4n2: ios=12/2757120, merge=0/0, ticks=1/112481, in_queue=112483, util=100.00%
  nvme2n1: ios=0/1654272, merge=0/0, ticks=0/78006, in_queue=78007, util=99.36%
  nvme0n2: ios=36/2757120, merge=0/0, ticks=2/119025, in_queue=119027, util=100.00%
  nvme3n2: ios=18/2757120, merge=0/0, ticks=1/116557, in_queue=116559, util=100.00%
  nvme1n1: ios=0/1654272, merge=0/0, ticks=0/79178, in_queue=79178, util=99.38%
  nvme4n1: ios=0/1654272, merge=0/0, ticks=0/77170, in_queue=77170, util=99.36%
  nvme2n2: ios=20/2757120, merge=0/0, ticks=2/117807, in_queue=117808, util=100.00%