fio-test/results/crazn_seq_write/64k-psync-9.out
job1: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=105011: Thu Sep  5 06:51:00 2024
  write: IOPS=28.4k, BW=1772MiB/s (1858MB/s)(673GiB/388899msec); 0 zone resets
    clat (usec): min=65, max=10649, avg=276.80, stdev=72.69
     lat (usec): min=66, max=10650, avg=279.69, stdev=73.03
    clat percentiles (usec):
     |  1.00th=[  180],  5.00th=[  194], 10.00th=[  202], 20.00th=[  212],
     | 30.00th=[  227], 40.00th=[  262], 50.00th=[  289], 60.00th=[  297],
     | 70.00th=[  302], 80.00th=[  310], 90.00th=[  338], 95.00th=[  379],
     | 99.00th=[  619], 99.50th=[  660], 99.90th=[  717], 99.95th=[  758],
     | 99.99th=[ 1205]
   bw (  MiB/s): min= 1363, max= 2780, per=100.00%, avg=1777.53, stdev=31.28, samples=6201
   iops        : min=21818, max=44490, avg=28440.35, stdev=500.43, samples=6201
  lat (usec)   : 100=0.01%, 250=37.83%, 500=60.77%, 750=1.33%, 1000=0.04%
  lat (msec)   : 2=0.01%, 4=0.01%, 20=0.01%
  cpu          : usr=2.40%, sys=4.83%, ctx=11028560, majf=0, minf=145
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,11028480,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1772MiB/s (1858MB/s), 1772MiB/s-1772MiB/s (1858MB/s-1858MB/s), io=673GiB (723GB), run=388899-388899msec

Disk stats (read/write):
    dm-0: ios=48/11028353, merge=0/0, ticks=4/2879388, in_queue=2879392, util=100.00%, aggrios=11/2205696, aggrmerge=0/0, aggrticks=0/97218, aggrin_queue=97219, aggrutil=100.00%
  nvme0n1: ios=0/1654272, merge=0/0, ticks=0/77703, in_queue=77703, util=100.00%
  nvme3n1: ios=0/1654272, merge=0/0, ticks=0/78816, in_queue=78816, util=100.00%
  nvme1n2: ios=26/2757120, merge=0/0, ticks=2/116074, in_queue=116076, util=100.00%
  nvme4n2: ios=12/2757120, merge=0/0, ticks=2/113328, in_queue=113330, util=100.00%
  nvme2n1: ios=0/1654272, merge=0/0, ticks=0/79128, in_queue=79129, util=100.00%
  nvme0n2: ios=36/2757120, merge=0/0, ticks=2/115935, in_queue=115937, util=100.00%
  nvme3n2: ios=18/2757120, merge=0/0, ticks=1/117093, in_queue=117095, util=100.00%
  nvme1n1: ios=0/1654272, merge=0/0, ticks=0/77651, in_queue=77651, util=100.00%
  nvme4n1: ios=0/1654272, merge=0/0, ticks=0/78210, in_queue=78210, util=100.00%
  nvme2n2: ios=20/2757120, merge=0/0, ticks=1/118243, in_queue=118245, util=100.00%